Catalogs/КомбинацииКультур.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>КомбинацииКультур</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Культуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Культура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ур_ВидыКультур</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/КомбинацииПродуктовПереработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>КомбинацииПродуктовПереработки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПродуктыПереработки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПродуктПереработки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПродуктыПереработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ЦС_ЗаписьВидовКультур/Ext/Module.bsl
Процедура ВидыКультурПриЗаписиПриЗаписи(Источник, Отказ) Экспорт
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КомбинацииКультурКультуры.Ссылка
		|ИЗ
		|	Справочник.КомбинацииКультур.Культуры КАК КомбинацииКультурКультуры
		|ГДЕ
		|	КомбинацииКультурКультуры.Культура = &Культура
		|
		|СГРУППИРОВАТЬ ПО
		|	КомбинацииКультурКультуры.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КомбинацииПродуктовПереработкиПродуктыПереработки.Ссылка
		|ИЗ
		|	Справочник.КомбинацииПродуктовПереработки.ПродуктыПереработки КАК КомбинацииПродуктовПереработкиПродуктыПереработки
		|ГДЕ
		|	КомбинацииПродуктовПереработкиПродуктыПереработки.ПродуктПереработки = &Культура
		|
		|СГРУППИРОВАТЬ ПО
		|	КомбинацииПродуктовПереработкиПродуктыПереработки.Ссылка";

	Запрос.УстановитьПараметр("Культура", источник.ссылка);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Спр = ВыборкаДетальныеЗаписи.ссылка.получитьОбъект();
		Спр.Записать();
	КонецЦикла;

	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
КонецПроцедуры
